<script>
	import { screen } from '$lib';
	import Header from '$lib/menu/Header.svelte';
</script>

{#if $screen}
	<Header>О сайте</Header>
{/if}

<div class="col relative content-900 gap-10 padding-20">
	<p>
		Это платформa, где участники могут решать разнообразные головоломки и задачи на логику, смекалку
		и интеллект. После того, как участник предоставляет свое решение, оно проверяется другими более
		опытными пользователями, что помогает улучшить навыки и подходы к решению задач.
	</p>
	<p>
		Кроме того, на сайте предусмотрены возможности для обсуждения различных интеллектуальных тем,
		обмена мнениями и идеями. Это создает атмосферу обучения, взаимопомощи и общения с
		единомышленниками.
	</p>
	<p>
		Сайт стимулирует развитие мышления, логики и креативности участников, а также способствует
		расширению кругозора и обогащению интеллектуального опыта.
	</p>
	<p>
		Обязательно посетите раздел <a href="/discussions?topic=1">Ответы на частые вопросы</a>, 
		чтобы узнать больше.
	</p>
</div>
