<script>
	import { screen } from '$lib';

	import Header from '../discussions/ToReact.svelte';
</script>

{#if $screen}
	<Header topic="1">О сайте</Header>
{/if}

<div class="col relative content-900 gap-10 padding-20">
	<p>
		Приветствуем вас на платформе, где живут головоломки и задачи на логику, смекалку и интеллект! 
		Здесь вы сможете испытать себя и свои способности, а также поучиться у других участников.
	</p>
	<p>
		Наша миссия – помочь вам взглянуть на привычные вещи под другим углом и расширить границы вашего сознания. 
		Ведь чтобы решить задачу, нужно проявить креативность и выйти за рамки обычного.
	</p>
	<p>
		Присоединяйтесь к нашему сообществу, где можно общаться на темы, связанные с развитием мышления и логики, 
		обмениваться опытом и находить единомышленников. 
		Обучайтесь у других участников, ищите наставников и делитесь своими знаниями. 
		Давайте вместе расширять сознание друг друга и вносить вклад в развитие сообщества любителей пораскинуть мозгами!
	</p>

	<a class="center top-20" href="/discussions?topic=1">Ответы на частые вопросы</a>
</div>
